# SupportsManualAdjustment Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
AnalyticalModel..::..SupportsManualAdjustment Method
AnalyticalModel Class See Also
---
Indicates if the Element supports Manual Analytical Adjustment.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool SupportsManualAdjustment()
```

Visual Basic
---
```text
Public Function SupportsManualAdjustment As Boolean
```

Visual C++
---
```text
public:
bool SupportsManualAdjustment()
```

# ### Return Value
True if Manual Adjustment is possible, false otherwise.
# See Also
AnalyticalModel Class
Autodesk.Revit.DB.Structure Namespace